>We could look into allowing a history of plans stored in the configmaps if storeReadablePlan is enabled.
Maybe add an optional parameter to the CRD with a max amount of plans stored, since we are already using a sha on plan ids we could allow this setting to store the last 10 plans or something. It will create clutter in the cluster though.

Yes, and I worry in a case where something has gone wrong then it will be retrying a lot which can make a plan that you would like to debug disappear due to the limit on how many plan that could be stored.

>Maybe consider a way to store historical apply outputs encrypted to blob storage? It will complicate the controller/runner a little, but it could be an option.

Could be an option, but yes would be nice to avoid adding additional complexity.

I did some more looking into this and it seems like the sensitive values are only displayed when the terraform plan is in JSON.

I tested with the following Terraform config:

```hcl
terraform {
  required_providers {
    tls = {
      source  = "hashicorp/tls"
      version = "4.0.5"
    }
  }
}

resource "tls_private_key" "example" {
  algorithm = "ECDSA"
}

provider "tls" {
  # Configuration options
}

output "hello_safe" {
  value = "Hello, World! I'm safe!"
}

output "hello_unsafe" {
  value     = "Hello, World! I'm sensitive!"
  sensitive = true
}
```

### Create the plan

```sh
terraform plan -out=tfplan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tls_private_key.example will be created
  + resource "tls_private_key" "example" {
      + algorithm                     = "ECDSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hello_safe   = "Hello, World! I'm safe!"
  + hello_unsafe = (sensitive value)

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

``` 
### Output as human readable plan

Sensitive values are masked

```
terraform show tfplan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tls_private_key.example will be created
  + resource "tls_private_key" "example" {
      + algorithm                     = "ECDSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hello_safe   = "Hello, World! I'm safe!"
  + hello_unsafe = (sensitive value)
```

### Output as JSON plan
Sensitive values are displayed
```sh
terraform show -json tfplan | jq
{
  "format_version": "1.2",
  "terraform_version": "1.5.7",
  "planned_values": {
    "outputs": {
      "hello_safe": {
        "sensitive": false,
        "type": "string",
        "value": "Hello, World! I'm safe!"
      },
      "hello_unsafe": {
        "sensitive": true,
        "type": "string",
        "value": "Hello, World! I'm sensitive!"
      }
    },
    "root_module": {
      "resources": [
        {
          "address": "tls_private_key.example",
          "mode": "managed",
          "type": "tls_private_key",
          "name": "example",
          "provider_name": "registry.terraform.io/hashicorp/tls",
          "schema_version": 1,
          "values": {
            "algorithm": "ECDSA",
            "ecdsa_curve": "P224",
            "rsa_bits": 2048
          },
          "sensitive_values": {}
        }
      ]
    }
  },
  "resource_changes": [
    {
      "address": "tls_private_key.example",
      "mode": "managed",
      "type": "tls_private_key",
      "name": "example",
      "provider_name": "registry.terraform.io/hashicorp/tls",
      "change": {
        "actions": [
          "create"
        ],
        "before": null,
        "after": {
          "algorithm": "ECDSA",
          "ecdsa_curve": "P224",
          "rsa_bits": 2048
        },
        "after_unknown": {
          "id": true,
          "private_key_openssh": true,
          "private_key_pem": true,
          "private_key_pem_pkcs8": true,
          "public_key_fingerprint_md5": true,
          "public_key_fingerprint_sha256": true,
          "public_key_openssh": true,
          "public_key_pem": true
        },
        "before_sensitive": false,
        "after_sensitive": {
          "private_key_openssh": true,
          "private_key_pem": true,
          "private_key_pem_pkcs8": true
        }
      }
    }
  ],
  "output_changes": {
    "hello_safe": {
      "actions": [
        "create"
      ],
      "before": null,
      "after": "Hello, World! I'm safe!",
      "after_unknown": false,
      "before_sensitive": false,
      "after_sensitive": false
    },
    "hello_unsafe": {
      "actions": [
        "create"
      ],
      "before": null,
      "after": "Hello, World! I'm sensitive!",
      "after_unknown": false,
      "before_sensitive": true,
      "after_sensitive": true
    }
  },
  "prior_state": {
    "format_version": "1.0",
    "terraform_version": "1.5.7",
    "values": {
      "outputs": {
        "hello_safe": {
          "sensitive": false,
          "value": "Hello, World! I'm safe!",
          "type": "string"
        },
        "hello_unsafe": {
          "sensitive": true,
          "value": "Hello, World! I'm sensitive!",
          "type": "string"
        }
      },
      "root_module": {}
    }
  },
  "configuration": {
    "provider_config": {
      "tls": {
        "name": "tls",
        "full_name": "registry.terraform.io/hashicorp/tls",
        "version_constraint": "4.0.5"
      }
    },
    "root_module": {
      "outputs": {
        "hello_safe": {
          "expression": {
            "constant_value": "Hello, World! I'm safe!"
          }
        },
        "hello_unsafe": {
          "sensitive": true,
          "expression": {
            "constant_value": "Hello, World! I'm sensitive!"
          }
        }
      },
      "resources": [
        {
          "address": "tls_private_key.example",
          "mode": "managed",
          "type": "tls_private_key",
          "name": "example",
          "provider_config_key": "tls",
          "expressions": {
            "algorithm": {
              "constant_value": "ECDSA"
            }
          },
          "schema_version": 1
        }
      ]
    }
  },
  "timestamp": "2024-05-31T14:03:35Z"
}
```

So we could either just support printing the plan in a human readable format to STDOUT?
